#ifndef __sphere__
#define __sphere__

//------------------------------------------------------------------------------
// sphere.h - содержит описание треугольника
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

# include "rnd.h"

//------------------------------------------------------------------------------
// треугольник
struct sphere {
    double density;
    int radius; // стороны
};

// Ввод параметров треугольника из файла
void In(sphere &t, ifstream &ifst);

// Случайный ввод параметров треугольника
void InRnd(sphere &e);

// Вывод параметров треугольника в форматируемый поток
void Out(sphere &t, ofstream &ofst);

// Вычисление периметра треугольника
double Area(sphere &t);

#endif
