//------------------------------------------------------------------------------
// sphere.cpp - содержит функции обработки сферы
//------------------------------------------------------------------------------

#include "sphere.h"

extern "C" float area_sphere(int radius);

//------------------------------------------------------------------------------
// Ввод параметров сферы из потока
void In(sphere &s, ifstream &ifst) {
    ifst >> s.density >> s.radius;
}

// Случайный ввод параметров сферы
void InRnd(sphere &s) {
    s.density = (double) Random();
    s.radius = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров сферы в поток
void Out(sphere &s, ofstream &ofst) {
    ofst << "It is Sphere: density = " << s.density
         << ", radius = " << s.radius
         << ". Area = " << Area(s) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра сферы
double Area(sphere &s) {
    return area_sphere(s.radius);
}
