//
// Created by ainthero on 10/17/21.
//

//------------------------------------------------------------------------------
// sphere.cpp - содержит методы шара
//------------------------------------------------------------------------------

#include "sphere.h"

//------------------------------------------------------------------------------
// Ввод параметров шара из файла
void Sphere::In(ifstream &ifst) {
    ifst >> density >> radius;
}

// Случайный ввод параметров шара
void Sphere::InRnd() {
    density = Shape::rnd_dbl.Get();
    radius = Shape::rnd20.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров шара в форматируемый поток
void Sphere::Out(ofstream &ofst) {
    ofst << "It is Sphere: density = " << density
    << ", radius = " << radius
    << ". Area = " << Area() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади поверхности шара
double Sphere::Area() {
    return 4 * 3.14159265359 * radius * radius;
}

